modules/correos/views/templates/admin/soap_requests/citypaq_states.tpl

{*
* 2015-2016 YDRAL.COM
*
* NOTICE OF LICENSE
*
*  @author YDRAL.COM <info@ydral.com>
*  @copyright 2015-2016 YDRAL.COM
*  @license GNU General Public License version 2
*
* You can not resell or redistribute this software.
*}

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cor="http://www.correos.es/paq/correospaq">
    <soapenv:Body>
        <cor:getStatesWithCitypaq/>
    </soapenv:Body>
</soapenv:Envelope>